import sqlite3  # Импорт модуля для работы с SQLite
import sys  # Импорт системного модуля

import PyQt5
from PyQt5.QtWidgets import QMainWindow, QApplication

from med import Ui_MainWindow  # Импорт дизайна интерфейса, созданного в Qt Designer

class MainWindow(QMainWindow):  # Определение класса MainWindow, наследующего QMainWindow
    def __init__(self):
        super().__init__()  # Вызов конструктора базового класса
        self.animation = None
        self.ui = Ui_MainWindow()  # Создание экземпляра дизайна интерфейса
        self.ui.setupUi(self)  # Настройка интерфейса в текущем окне
########################################################################################################################
########################################################################################################################


########################################################################################################################
########################################################################################################################
if __name__ == "__main__":
    app = QApplication(sys.argv)
    window = MainWindow()
    window.show()
    sys.exit(app.exec_())